partitioned-pipe/fluid1-openfoam-sonicliquidfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

mu              mu  [1 -1 -1 0 0 0 0] 1e1;
